In [2]:
! pip install panda

Requirement already satisfied: panda in c:\users\bishal\appdata\local\programs\python\python312\lib\site-packages (0.3.1)
Requirement already satisfied: setuptools in c:\users\bishal\appdata\local\programs\python\python312\lib\site-packages (from panda) (69.5.1)
Requirement already satisfied: requests in c:\users\bishal\appdata\local\programs\python\python312\lib\site-packages (from panda) (2.31.0)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\bishal\appdata\local\programs\python\python312\lib\site-packages (from requests->panda) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\users\bishal\appdata\local\programs\python\python312\lib\site-packages (from requests->panda) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\bishal\appdata\local\programs\python\python312\lib\site-packages (from requests->panda) (2.2.1)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\bishal\appdata\local\programs\python\python312\lib\site-packages (from requests->panda) (2024.2.2)

[notice] A new release of pip is available: 24.1.1 -> 24.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:

import pandas as pd

# Task 1

## Creating DataFrame from Dictionary

In [6]:
my_dict = {
    "Product" : ["Iphone", "Tablet" , "Bike"],
    "Price" : [650, 250, 100],
    "Stock" : [10, 50, 100]
}

# Creating Dataframe from Dictionary

my_dataframe = pd.DataFrame(my_dict)

In [7]:
my_dataframe

  Product  Price  Stock
0  Iphone    650     10
1  Tablet    250     50
2    Bike    100    100

## Creating DataFrame from the List of Dictionary

In [8]:
data_list_of_dicts = [
    {'EmployeeID': 101, 'Name': 'Bishal Gyawali', 'Department': 'IT'},
    {'EmployeeID': 102, 'Name': 'Natasha Chand', 'Department': 'Health'},
    {'EmployeeID': 103, 'Name': 'Dhurba Basnet', 'Department': 'Marketing'}
]

data_frame = pd.DataFrame(data_list_of_dicts)

In [9]:
data_frame

   EmployeeID            Name Department
0         101  Bishal Gyawali         IT
1         102   Natasha Chand     Health
2         103   Dhurba Basnet  Marketing

In [13]:
# Load the dataset
df = pd.read_csv('messed_dataset.csv')
print(df.head())

                Name   Age                Email      Country    Salary  \
0            invalid  59.0  ycastro@example.org  Switzerland  44694.24
1    David Jefferson  21.0                  NaN        China       NaN
2      Jessica Reyes  34.0                  NaN          NaN  60511.62
3  Kenneth Macdonald  68.0    ewolf@example.com        Italy  84223.29
4        Julie Horne  78.0                  NaN      Ecuador  24665.13

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24
3    2022-04-07
4    2020-06-19

# Task 2

- Basic Data Cleaning

In [14]:
# Showing first three rows using head
df.head(3)

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,NaN,China,NaN,2021-10-04
2,Jessica Reyes,34.0,NaN,NaN,60511.62,2022-05-24

In [15]:
# Showing last 5 rows using tail
df.tail(5)

,Name,Age,Email,Country,Salary,DateOfJoining
95,Garrett Davidson,56.0,gjames@example.com,Solomon Islands,86227.88,NaN
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
97,NaN,72.0,brian50@example.com,Somalia,90628.22,2020-04-11
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,NaN,South Africa,20289.17,2021-09-23

In [16]:
# Summary of DataFrame and their datatypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           89 non-null     object
 1   Age            97 non-null     object
 2   Email          80 non-null     object
 3   Country        86 non-null     object
 4   Salary         94 non-null     object
 5   DateOfJoining  79 non-null     object
dtypes: object(6)
memory usage: 4.8+ KB

In [36]:
# Basic Stastics of dataframe
df.describe(include = "all")

           Name   Age                Email Country   Salary DateOfJoining
count        89    97                   80      86       94            79
unique       85    53                   80      76       93            79
top     invalid  76.0  ycastro@example.org  Greece  invalid    2022-09-29
freq          5     6                    1       2        2             1

In [39]:
# Shape of the dataframe
df.shape

(100, 6)

In [40]:
# Column of the dataframe
df.columns

Index(['Name', 'Age', 'Email', 'Country', 'Salary', 'DateOfJoining'], dtype='object')

# Task 3
- Data Analysis. Analyse the data by giving the summary statistics, and more information about the data

In [42]:
# Select a single column using the column name as a key
age_column = df['Age']
age_column

# Select a single column using the column name as an attribute
age_column = df.Age
age_column

0     59.0
1     21.0
2     34.0
3     68.0
4     78.0
      ...
95    56.0
96    52.0
97    72.0
98    65.0
99    42.0
Name: Age, Length: 100, dtype: object

In [43]:
# Select multiple column
selected_columns = df[["Age", "Email"]]
selected_columns

     Age                     Email
0   59.0       ycastro@example.org
1   21.0                       NaN
2   34.0                       NaN
3   68.0         ewolf@example.com
4   78.0                       NaN
..   ...                       ...
95  56.0        gjames@example.com
96  52.0  richardlewis@example.net
97  72.0       brian50@example.com
98  65.0      lramirez@example.org
99  42.0                       NaN

[100 rows x 2 columns]

In [46]:
# Select rows by index using iloc
first_row = df.iloc[0]
first_row

Name                         invalid
Age                             59.0
Email            ycastro@example.org
Country                  Switzerland
Salary                      44694.24
DateOfJoining             2022-09-29
Name: 0, dtype: object

In [47]:
# Select multiple rows by index using iloc
multiple_rows = df.iloc[0:5]
multiple_rows

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,NaN,China,NaN,2021-10-04
2,Jessica Reyes,34.0,NaN,NaN,60511.62,2022-05-24
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,NaN,Ecuador,24665.13,2020-06-19

In [58]:
# Select rows by label using loc
name_row = df.loc['David Jefferson']
name_row

Age                    21.0
Email                   NaN
Salary                  NaN
DateOfJoining    2021-10-04
Name: David Jefferson, dtype: object

In [64]:
df.isna()

                      Age  Email  Salary  DateOfJoining
Name
invalid             False  False   False          False
David Jefferson     False   True    True          False
Jessica Reyes       False   True   False          False
Kenneth Macdonald   False  False   False          False
Julie Horne         False   True   False          False
...                   ...    ...     ...            ...
Garrett Davidson    False  False   False           True
Elizabeth Ross      False  False   False          False
NaN                 False  False   False          False
Patricia Singh      False  False   False          False
Christopher Stokes  False   True   False          False

[100 rows x 4 columns]

# Data Visualization
- Visualize the data by using the visualization libraries

In [ ]:
# Your code goes here